app/controllers/assignments_controller.rb

  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save
---
INSERT INTO "assignments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "SGSI"], ["created_at", "2022-10-06 14:56:58.967778"], ["updated_at", "2022-10-06 14:56:58.967778"]]