app/controllers/degrees_controller.rb

SELECT "degrees".* FROM "degrees"
---
  def index
    @degrees = Degree.all

INSERT INTO "degrees" ("name", "created_at", "updated_at", "school_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ingeniería en Tecnologías de Internet"], ["created_at", "2022-10-07 06:30:09.736592"], ["updated_at", "2022-10-07 06:30:09.736592"], ["school_id", 1]]
---
  def create
    @degree = Degree.new(degree_params)

    respond_to do |format|
      if @degree.save

UPDATE "degrees" SET "updated_at" = $1, "school_id" = $2 WHERE "degrees"."id" = $3  [["updated_at", "2022-10-07 06:29:11.480698"], ["school_id", 1], ["id", 1]]
---
  def update
    respond_to do |format|
      if @degree.update(degree_params)

SELECT "degrees".* FROM "degrees" WHERE "degrees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_degree
      @degree = Degree.find(params[:id])