app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "phone_number", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Facultad de Telemática"], ["phone_number", "3123334444"], ["address", "Las Viboras #333"], ["created_at", "2022-10-06 06:45:39.035544"], ["updated_at", "2022-10-06 06:45:39.035544"]]
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save